{
  "category": [
    {
      "categoryName": "HTML",
      "id": "93e9"
    },
    {
      "id": "14b0",
      "categoryName": "React"
    },
    {
      "id": "a48f",
      "categoryName": "JavaScript"
    }
  ],
  "projects": [
    {
      "title": "Loft City – Vacation Rental Website",
      "short_description": "A responsive and modern vacation rental platform built with ReactJS, designed to showcase rental properties with a clean and engaging user experience.",
      "description": "Loft City is a fully responsive web project developed with ReactJS, tailored for vacation rental businesses. The platform combines sleek design with functional UI/UX to deliver a professional and user-friendly browsing experience for travelers and property managers.\n\nThe website emphasizes visual storytelling through well-structured layouts that highlight rental properties with clarity and appeal. It’s designed with a mobile-first approach, ensuring seamless accessibility across all devices, from smartphones to desktops.\n\nBy using modular and reusable React components, Loft City ensures scalability, maintainability, and future enhancements with minimal effort. The clean codebase, along with attention to modern design practices, makes this project both a portfolio highlight and a potential real-world business solution.\n\nThis project reflects my expertise in front-end web development, responsive design, and ReactJS component architecture, as well as my passion for crafting professional and engaging digital experiences.",
      "category": "React",
      "tags": [
        "ReactJS",
        "Responsive Design",
        "Web Development",
        "Vacation Rental Website",
        "Frontend Development",
        "UI/UX Design",
        "Portfolio Project",
        "React Components",
        "Modern Web Design"
      ],
      "features": [
        "Responsive & Mobile-first Design – optimized for all screen sizes",
        "Property Showcase Layouts – clear and attractive sections for vacation rentals",
        "Clean UI/UX – focused on simplicity and visual appeal",
        "Reusable React Components – modular codebase for scalability",
        "Fast & Lightweight – optimized performance for smooth browsing",
        "Future-ready – easily extendable for booking systems",
        "filters",
        "and admin dashboards."
      ],
      "techStack": [
        "React",
        "Tailwind",
        "TypeScript",
        "React Router",
        "React Icons"
      ],
      "images": [
        "https://res.cloudinary.com/dfdzkqstt/image/upload/v1755680854/Screenshot_622_j3hrer.png",
        "https://res.cloudinary.com/dfdzkqstt/image/upload/v1755681013/Screenshot_627_xpvc7n.png",
        "https://res.cloudinary.com/dfdzkqstt/image/upload/v1755681013/Screenshot_628_tfc7hg.png",
        "https://res.cloudinary.com/dfdzkqstt/image/upload/v1755681013/Screenshot_623_eemo4i.png"
      ],
      "links": {
        "github": "https://github.com/sheikh92areeb/loft-city",
        "live": "https://loftcity.netlify.app/"
      },
      "id": "f733"
    },
    {
      "id": "19d9",
      "title": "Weather App – Real-Time Weather App",
      "short_description": "A simple and responsive weather application built with HTML, CSS, and JavaScript that fetches real-time weather data using a public Weather API.",
      "description": "Weather App is a responsive web application designed to provide real-time weather updates for any city worldwide. Developed with vanilla HTML, CSS, and JavaScript, the app consumes a public Weather API to deliver accurate and up-to-date information including temperature, humidity, wind speed, and weather conditions.\\n\\nThe application focuses on simplicity and usability, offering a clean user interface with intuitive search functionality. A mobile-first approach ensures smooth accessibility across devices, from smartphones to desktops. By leveraging asynchronous JavaScript (fetch API), WeatherNow delivers quick responses and enhances user interaction.\\n\\nThis project demonstrates core web development skills, API integration, and dynamic DOM manipulation without relying on frameworks. It is an excellent showcase of problem-solving, responsiveness, and practical implementation of real-world API data.",
      "category": "HTML",
      "tags": [
        "JavaScript",
        "Weather API",
        "Responsive Design",
        "Frontend Development",
        "Real-Time Data",
        "Vanilla JS",
        "Dynamic DOM",
        "API Integration"
      ],
      "features": [
        "Real-time Weather Data – fetches live weather details using API",
        "City-based Search – users can search for any city worldwide",
        "Responsive Design – optimized for mobile",
        "tablet",
        "and desktop devices",
        "Dynamic UI Updates – weather info displayed instantly without page reload",
        "Error Handling – user-friendly messages for invalid inputs or API errors",
        "Clean and Minimal Interface – focused on simplicity and readability"
      ],
      "techStack": [
        "HTML",
        "CSS",
        "JavaScript",
        "Weather API"
      ],
      "images": [
        "https://res.cloudinary.com/dfdzkqstt/image/upload/v1757185204/Screenshot_2025-03-20_181458_j46wu4.png",
        "https://res.cloudinary.com/dfdzkqstt/image/upload/v1757185205/Screenshot_2025-03-20_181522_y1czjk.png"
      ],
      "links": {
        "github": "",
        "live": "https://weather-app-118.netlify.app/"
      }
    },
    {
      "id": "ad2b",
      "title": "My To-Do App – Simple To-Do App",
      "short_description": "A lightweight and minimal to-do application built with HTML, CSS, and JavaScript that allows users to add daily tasks quickly.",
      "description": "My To-Do App is a simple to-do list web application developed with HTML, CSS, and JavaScript. The app focuses on simplicity and provides users the ability to add tasks instantly without complex features. It is designed as a practice project to demonstrate dynamic DOM manipulation, event handling, and responsive UI with vanilla JavaScript. This project highlights the fundamentals of creating interactive front-end applications without external libraries or frameworks. While the app does not persist data (tasks reset on refresh), it showcases essential web development skills such as capturing user input, rendering elements dynamically, and handling basic user interactions. My To-Do App reflects my ability to build clean, responsive, and beginner-friendly web apps that prioritize usability and simplicity.",
      "category": "JavaScript",
      "tags": [
        "JavaScript",
        "HTML",
        "CSS",
        "Frontend Development",
        "To-Do App",
        "Vanilla JS",
        "Dynamic DOM",
        "Practice Project"
      ],
      "features": [
        "Add Tasks Instantly – quick input for creating tasks",
        "Dynamic DOM Manipulation – tasks appear instantly without reload",
        "Lightweight and Simple – minimal UI for quick usage",
        "Responsive Layout – accessible on both desktop and mobile",
        "Beginner-Friendly Code – ideal for learning basic JavaScript"
      ],
      "techStack": [
        "HTML",
        "CSS",
        "JavaScript"
      ],
      "images": [
        "https://res.cloudinary.com/dfdzkqstt/image/upload/v1757185203/Screenshot_2025-03-11_001934_cidnqm.png"
      ],
      "links": {
        "github": "https://github.com/sheikh92areeb/PSDC-Full-Course/tree/main/assignments/assignment-19",
        "live": "https://todo-118.netlify.app/"
      }
    },
    {
      "id": "0f50",
      "title": "aTask | Your Tasks Manager",
      "short_description": "A full-featured task manager built with React and Tailwind CSS, offering task creation, editing, deletion, completion tracking, and data persistence using local storage.",
      "description": "aTask is a modern and fully functional to-do application designed to manage daily tasks efficiently. Developed with React and styled using Tailwind CSS, the app provides a seamless and intuitive user experience. Users can add, edit, delete, and mark tasks as completed with real-time UI updates.\\n\\nUnlike basic to-do apps, aTask incorporates data persistence through local storage, ensuring that tasks remain saved even after refreshing the page or closing the browser. The clean and responsive design makes it accessible across all devices, from smartphones to desktops.\\n\\nThis project reflects my skills in building feature-rich front-end applications using React, managing component state effectively, applying Tailwind utility classes for rapid styling, and implementing local storage for offline data persistence.",
      "category": "React",
      "tags": [
        "ReactJS",
        "Tailwind CSS",
        "Local Storage",
        "Frontend Development",
        "Task Manager",
        "To-Do App",
        "CRUD Operations",
        "Responsive Design",
        "State Management"
      ],
      "features": [
        "Add New Tasks – quickly capture tasks with a simple form",
        "Edit Existing Tasks – update task details dynamically",
        "Delete Tasks – remove unwanted tasks instantly",
        "Mark as Completed – toggle tasks between done and active states",
        "View Completed Tasks – filter and display finished tasks",
        "Local Storage Integration – persist data across sessions",
        "Responsive Design – optimized for all devices",
        "Modern UI with Tailwind CSS – clean and professional look"
      ],
      "techStack": [
        "React",
        "Tailwind CSS",
        "JavaScript",
        "Local Storage"
      ],
      "images": [
        "https://res.cloudinary.com/dfdzkqstt/image/upload/v1757185177/Screenshot_585_dyyc29.png",
        "https://res.cloudinary.com/dfdzkqstt/image/upload/v1757185206/Screenshot_2025-04-01_154932_dfpq3k.png"
      ],
      "links": {
        "github": "https://github.com/sheikh92areeb/todo-react-app",
        "live": "https://atask-18.netlify.app/"
      }
    },
    {
      "id": "2a95",
      "title": "My Calculator – Futuristic Calculator App",
      "short_description": "A modern and futuristic calculator built with React, designed with a sleek responsive UI to handle all basic arithmetic operations.",
      "description": "My Calculator is a basic calculator application developed using React with a modern, futuristic design. It supports all essential arithmetic operations including addition, subtraction, multiplication, and division. The app focuses on delivering a clean and responsive interface, providing users with a smooth and intuitive experience across all devices.\\n\\nWith a focus on usability and aesthetics, CalcX combines functional performance with a visually appealing design. Its modular React component structure ensures scalability and maintainability, while the responsive layout adapts perfectly to both mobile and desktop environments.\\n\\nThis project highlights my expertise in building interactive React applications, designing futuristic user interfaces, and managing application state for real-time updates.",
      "category": "React",
      "tags": [
        "ReactJS",
        "Calculator",
        "Frontend Development",
        "Responsive Design",
        "UI/UX Design",
        "Futuristic Design",
        "Arithmetic Operations",
        "Portfolio Project"
      ],
      "features": [
        "Addition – perform quick and accurate sums",
        "Subtraction – calculate differences between numbers",
        "Multiplication – handle multiple factors easily",
        "Division – perform precise division operations",
        "Clear & Reset Function – reset calculations with one click",
        "Responsive Design – works seamlessly on mobile and desktop",
        "Futuristic UI – modern and sleek design with advanced styling"
      ],
      "techStack": [
        "React",
        "CSS",
        "JavaScript",
        "Tailwind"
      ],
      "images": [
        "https://res.cloudinary.com/dfdzkqstt/image/upload/v1757788605/Screenshot_629_f3uuhu.png",
        "https://res.cloudinary.com/dfdzkqstt/image/upload/v1757788605/Screenshot_2025-09-13_233525_kouywp.png",
        "https://res.cloudinary.com/dfdzkqstt/image/upload/v1757788605/Screenshot_630_ytetbc.png"
      ],
      "links": {
        "github": "https://github.com/sheikh92areeb/react.js-projects/tree/main/Basic-Projects/02-Basic-Calculator",
        "live": "https://my-calculator-18.netlify.app/"
      }
    }
  ]
}